# Задание 1. Работа с математическими операциями в Python
# Задача 1. Нахождение минимального числа среди трех введенных
num1 = float(input("Введите первое число: "))
num2 = float(input("Введите второе число: "))
num3 = float(input("Введите третье число: "))

min_num = min(num1, num2, num3)
print("Минимальное число:", min_num)

# Задача 2. Вывод чисел из интервала [1, 50] из трех введенных
num1 = int(input("Введите первое число: "))
num2 = int(input("Введите второе число: "))
num3 = int(input("Введите третье число: "))

num_in_range = [num for num in [num1, num2, num3] if 1 <= num <= 50]
print("Числа в интервале [1, 50]:", num_in_range)

# Задача 3. Последовательность умножения вещественного числа m на числа от 1 до 10
m = float(input("Введите вещественное число m: "))

for i in range(1, 11):
    result = i * m
    print(f"{i} * {m} = {result}")


# Задача 4. Нахождение суммы и количества чисел в последовательности
x = []
print("Введите последовательность целых чисел (для завершения введите пустую строку): ")

while True:
    number = input("Введите число: ")
    if number == "":
        break
    else:
        x.append(int(number))

total_sum = sum(x)
count = len(x)

print(f"Сумма чисел последовательности: {total_sum}")
print(f"Количество чисел в последовательности: {count}")